In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("./data/iris.csv")

In [5]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [6]:
df["is_setosa"]= np.where(df["Species"]=="setosa",1,0)

In [7]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1
2           4.7          3.2           1.3          0.2  setosa          1
3           4.6          3.1           1.5          0.2  setosa          1
4           5.0          3.6           1.4          0.2  setosa          1

In [8]:
pd.crosstab(df["Species"],df["is_setosa"])

is_setosa    0   1
Species
setosa       0  50
versicolor  50   0
virginica   50   0

In [9]:
df["is_setosa2"] = (df["Species"]=="setosa")+0 #true/false를 integer로 변경할 때 쓰는 trick
df["is_setosa3"] = (df["Species"]=="setosa")*1 #true/false를 integer로 변경할 때 쓰는 trick
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa2,is_setosa3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [10]:
df.rename({"Sepal_Length":"SL"})

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa2,is_setosa3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0
146,6.3,2.5,5.0,1.9,virginica,0,0,0
147,6.5,3.0,5.2,2.0,virginica,0,0,0
148,6.2,3.4,5.4,2.3,virginica,0,0,0
149,5.9,3.0,5.1,1.8,virginica,0,0,0

In [11]:
df.rename(columns={"Sepal.Length":"SL"})

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa2,is_setosa3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0
146,6.3,2.5,5.0,1.9,virginica,0,0,0
147,6.5,3.0,5.2,2.0,virginica,0,0,0
148,6.2,3.4,5.4,2.3,virginica,0,0,0
149,5.9,3.0,5.1,1.8,virginica,0,0,0

In [12]:
df = df.rename(columns={"Sepal.Length":"SL"})
df.head(2)

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa2,is_setosa3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1

In [17]:
bike = pd.read_csv("./data/bike.csv")

In [19]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [20]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [21]:
bike.iloc[:,9:11]

       casual  registered
0           3          13
1           8          32
2           5          27
3           3          10
4           0           1
...       ...         ...
10881       7         329
10882      10         231
10883       4         164
10884      12         117
10885       4          84

[10886 rows x 2 columns]

In [59]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [60]:
type(bike.columns)

pandas.core.indexes.base.Index

In [61]:
bike.columns.isin(["casual","registered"])

array([False, False, False, False, False, False, False, False, False,
        True,  True, False])

In [64]:
np.where(bike.columns.isin(["casual","registered"])==True)[0][-1]

10

In [65]:
index_list = np.where(bike.columns.isin(["casual","registered"])==True)[0]

In [68]:
bike.iloc[:,index_list[0]:index_list[-1]+1]

       casual  registered
0           3          13
1           8          32
2           5          27
3           3          10
4           0           1
...       ...         ...
10881       7         329
10882      10         231
10883       4         164
10884      12         117
10885       4          84

[10886 rows x 2 columns]

In [39]:
bike["casual"]

0         3
1         8
2         5
3         3
4         0
         ..
10881     7
10882    10
10883     4
10884    12
10885     4
Name: casual, Length: 10886, dtype: int64

In [40]:
bike["registered"]

0         13
1         32
2         27
3         10
4          1
        ...
10881    329
10882    231
10883    164
10884    117
10885     84
Name: registered, Length: 10886, dtype: int64

In [57]:
index_list[1]

IndexError: tuple index out of range

In [69]:
df_sub = pd.DataFrame([bike["casual"],bike["registered"]]).transpose()

In [72]:
df_sub.head()

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [76]:
bike_sub = bike.iloc[:4,9:11] #row 4개

In [77]:
bike_sub.head()

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10

In [78]:
bike_sub=bike.loc[:4,["casual","registered"]]

In [79]:
bike_sub.head()

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [82]:
bike_sub = bike.loc[:4,"casual":"registered"] #row 5개, iloc와 loc의 차이 확인

In [83]:
bike_sub.head()

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [84]:
bike_sub.sum()

casual        19
registered    83
dtype: int64

In [85]:
bike_sub.sum(axis=1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [86]:
bike_sub.apply(func=sum, axis=1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [88]:
bike_sub.apply(func=mean, axis=1)

NameError: name 'mean' is not defined

In [89]:
bike_sub.apply(func=pd.Series.mean)

casual         3.8
registered    16.6
dtype: float64

In [91]:
bike_sub.apply(func= lambda x:x.mean().round())

casual         4.0
registered    17.0
dtype: float64

In [92]:
bike_sub.apply(func= lambda x:round(x.mean()))

casual         4
registered    17
dtype: int64

In [93]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      5 non-null      int64
 1   registered  5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [96]:
bike_sub.head()

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [97]:
bike_sub["casual"]

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: int64

In [98]:
bike_sub["casual"].astype("str")

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: object

In [99]:
bike_sub["casual"].astype("float")

0    3.0
1    8.0
2    5.0
3    3.0
4    0.0
Name: casual, dtype: float64

In [102]:
bike_sub["casual"].astype("str") + "대"

0    3대
1    8대
2    5대
3    3대
4    0대
Name: casual, dtype: object

In [103]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [104]:
bike["datetime"][:3].str.slice(0,4)

0    2011
1    2011
2    2011
Name: datetime, dtype: object

In [105]:
bike["datetime"][:3].str.slice(5,7)

0    01
1    01
2    01
Name: datetime, dtype: object

In [139]:
bike["datetime"][:3]

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
2    2011-01-01 02:00:00
Name: datetime, dtype: object

In [147]:
bike_time=pd.to_datetime(bike["datetime"][:3])

In [148]:
bike_time

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
Name: datetime, dtype: datetime64[ns]

In [149]:
print(bike_time.dt.year)

0    2011
1    2011
2    2011
Name: datetime, dtype: int64

In [150]:
print(bike_time.dt.month)

0    1
1    1
2    1
Name: datetime, dtype: int64

In [151]:
print(bike_time.dt.day)

0    1
1    1
2    1
Name: datetime, dtype: int64

In [152]:
print(bike_time.dt.hour)

0    0
1    1
2    2
Name: datetime, dtype: int64

In [153]:
print(bike_time.dt.minute)

0    0
1    0
2    0
Name: datetime, dtype: int64

In [154]:
print(bike_time.dt.second)

0    0
1    0
2    0
Name: datetime, dtype: int64

In [156]:
bike_time.dt.weekday

0    5
1    5
2    5
Name: datetime, dtype: int64

In [162]:
bike_dum = pd.get_dummies(data = bike, columns=["season"])
bike_dum.head(2)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_1,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,1,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,1,0,0,0

In [163]:
bike_dum = pd.get_dummies(data = bike, columns=["season"],
                         drop_first = True)
bike_dum.head(2)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,0,0,0

In [164]:
#question 1

In [176]:
df = pd.read_csv("data/bike.csv")

0       -4.555
1       -4.615
2       -4.615
3       -4.555
4       -4.555
         ...
10881   -4.115
10882   -2.665
10883   -1.970
10884   -3.485
10885   -3.545
Length: 10886, dtype: float64

In [175]:
df_sub = df.loc[:,["temp","atemp"]]
df_sub.head()

   temp   atemp
0  9.84  14.395
1  9.02  13.635
2  9.02  13.635
3  9.84  14.395
4  9.84  14.395

In [166]:
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [192]:
sr_sub = df["temp"].sub(df["atemp"])

In [196]:
sr_sub.abs()

0        4.555
1        4.615
2        4.615
3        4.555
4        4.555
         ...
10881    4.115
10882    2.665
10883    1.970
10884    3.485
10885    3.545
Length: 10886, dtype: float64

In [197]:
sr_sub.abs().mean()

3.509198511850083

In [199]:
sr_sub.abs().mean().round(3)

3.509

In [202]:
df = pd.read_csv("data/bike.csv")

In [203]:
df["diff"] = df["temp"]-df["atemp"]

In [204]:
df.head(3)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,diff
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,-4.555
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,-4.615
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,-4.615

In [207]:
df["diff"].abs().mean().round(3)

3.509

In [257]:
#문제 2

In [315]:
df = pd.read_csv("data/bike.csv")

In [316]:
df["new_date"] = pd.to_datetime(df["datetime"].str.slice(0,10))

In [317]:
day_list = df["new_date"].unique()

In [318]:
casual_max = [df[df["new_date"]== date]["casual"].max()  for date in day_list if (df[df["new_date"]== date]["casual"].max()) > 25 ]

In [319]:
print(casual_max)

[47, 33, 35, 52, 47, 62, 27, 35, 29, 73, 102, 35, 31, 83, 32, 39, 100, 149, 42, 32, 37, 50, 95, 175, 42, 111, 240, 83, 27, 53, 68, 29, 128, 156, 100, 29, 28, 57, 70, 181, 66, 44, 123, 68, 59, 30, 66, 89, 196, 166, 66, 79, 60, 64, 70, 107, 206, 76, 83, 78, 65, 52, 88, 76, 193, 161, 64, 72, 80, 55, 96, 169, 176, 78, 85, 83, 58, 85, 210, 159, 99, 206, 248, 242, 79, 79, 80, 61, 182, 146, 80, 57, 79, 94, 114, 234, 200, 91, 80, 69, 85, 51, 91, 105, 176, 161, 90, 97, 79, 96, 101, 175, 144, 70, 75, 86, 67, 88, 79, 82, 204, 245, 154, 54, 217, 180, 75, 72, 87, 39, 86, 148, 162, 85, 58, 84, 40, 68, 66, 63, 101, 262, 272, 164, 70, 27, 47, 80, 242, 204, 80, 72, 33, 46, 40, 33, 54, 159, 120, 40, 40, 31, 64, 191, 112, 55, 36, 31, 121, 100, 88, 29, 29, 60, 47, 33, 27, 30, 120, 41, 44, 156, 89, 33, 52, 42, 26, 33, 48, 61, 55, 28, 38, 56, 229, 85, 49, 40, 167, 108, 30, 58, 52, 68, 132, 212, 89, 96, 140, 100, 72, 367, 240, 120, 295, 132, 145, 113, 145, 240, 355, 260, 108, 88, 52, 74, 125, 311, 298, 115, 108, 46, 99, 81, 70, 87, 103, 241, 229, 102, 77, 76, 109, 140, 293, 255, 53, 75, 104, 134, 151, 361, 76, 297, 276, 103, 111, 111, 110, 147, 239, 204, 105, 57, 123, 117, 132, 295, 267, 61, 91, 121, 82, 102, 237, 129, 112, 124, 120, 108, 103, 90, 97, 138, 269, 182, 97, 95, 78, 93, 105, 98, 112, 222, 208, 112, 125, 119, 111, 111, 248, 235, 116, 97, 124, 130, 144, 289, 138, 257, 263, 209, 110, 86, 74, 95, 260, 284, 127, 168, 114, 108, 137, 350, 240, 129, 36, 85, 95, 48, 84, 112, 161, 362, 100, 121, 73, 92, 102, 138, 294, 249, 96, 104, 122, 102, 131, 50, 64, 136, 150, 39, 46, 49, 36, 78, 280, 304, 134, 45, 40, 29, 52, 179, 125, 55, 123, 142, 81, 56, 39, 39, 40, 167, 65, 38, 28, 34, 50, 57, 95, 67, 58, 37]

In [320]:
len(casual_max)

384

In [321]:
#solution by the teacher

In [330]:
bike= pd.read_csv("data/bike.csv")

In [331]:
bike["date"] = pd.to_datetime(bike["datetime"]).dt.date

In [332]:
bike_agg = bike.groupby("date")["casual"].max()

In [341]:
type(bike_agg)

pandas.core.series.Series

In [342]:
bike_agg_up25 =bike_agg[bike_agg>25]

In [343]:
len(bike_agg_up25)

384

In [344]:
bike_agg = bike.groupby("date")["casual"].max().reset_index() #group by로 나온 series를 reset index로 data frame으로 만드는 방법
bike_agg.head()

         date  casual
0  2011-01-01      47
1  2011-01-02      20
2  2011-01-03      14
3  2011-01-04      18
4  2011-01-05      12

In [345]:
#3번 문제

In [349]:
bike= pd.read_csv("data/bike.csv")

In [350]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [351]:
bike["hour"] = pd.to_datetime(bike["datetime"]).dt.hour

In [354]:
bike_sub = bike.groupby("hour")["registered"].mean().reset_index()

In [359]:
registered_max = bike_sub.where(bike_sub["registered"] == bike_sub["registered"].max())

In [360]:
registered_max = registered_max.dropna()

In [361]:
registered_max["hour"]

17    17.0
Name: hour, dtype: float64

In [362]:
#solution by the teacher

In [363]:
bike= pd.read_csv("data/bike.csv")

In [364]:
bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  object
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
dtypes: float64(3), int64(8), object(1)
memory usage: 1020.7+ KB

In [365]:
bike["hour"] = pd.to_datetime(bike["datetime"]).dt.hour

In [367]:
bike_hour = bike.groupby("hour")["registered"].mean().reset_index()

In [368]:
bike_hour

    hour  registered
0      0   44.826374
1      1   27.345815
2      2   18.080357
3      3    9.076212
4      4    5.144796
5      5   18.311947
6      6   72.109890
7      7  202.202198
8      8  341.226374
9      9  190.824176
10    10  128.973626
11    11  150.621978
12    12  187.677632
13    13  183.728070
14    14  166.853070
15    15  178.269737
16    16  241.289474
17    17  393.324561
18    18  369.462719
19    19  266.203947
20    20  191.785088
21    21  144.802632
22    22  110.973684
23    23   74.046053

In [369]:
bike_hour.loc[bike_hour["registered"] == bike_hour["registered"].max(),]

    hour  registered
17    17  393.324561

In [370]:
bike_hour.loc[bike_hour["registered"].idxmax(),]

hour           17.000000
registered    393.324561
Name: 17, dtype: float64